// จงเขียนโปรแกรมพิมพ์จำนวนเฉพาะตั้งแต่เลข 1 ถึง input

// ฟังก์ชั่นตรวจสอบตัวเลขเป็นเฉพาะหรือไม่
const isPrime = (num) => {
    let checked = true; // ค่าเริ่มต้นให้เป็นจริง
    // ถ้าเลขระหว่าง 2 - ก่อนตัวมันเอง หารแล้วไม่มีเศษแสดงว่าหารลงตัว ไม่เข้าเงื่อนไข แต่ 2 ไม่ทันได้หารนะ เพราะ i = 2, 2 <2 falst
    for (let i = 2; i < num; i++) {
        if (num % i == 0) { // ถ้าหารลงตัวก็ได้ค่าตรวจเป็น false จะไม่นำไปแสดงผล
            checked = false;
        }
    }
    return checked; // return ค่าออกไป ไม่งั้นจะขึ้น undefined
}

// ส่วนของการ run ตัวเลขตั้งแต่ 1 ถึงค่ารับเข้า
const numRunIsPrime = (run) => {
    for (let i = 1; i <= run; i++) { // run ไปให้ครบจำนวนที่ถูกต้อง
        if (isPrime(i) == true) { // ถ้าใช่ต้องใช่แน่ๆ log ออกมา
            console.log(i); // ถ้าใช่ก็ true log ออกมา ค่าเดียวกับที่ใส่เข้าไปฟังก์ัชั่น
            // แต่ถ้าไม่ใช่ก็ไม่ได้ log อะไร ก็แค่ทำงานฟรีไปเฉยๆ
        }
    }

}

//ใส่ค่ามาเลย
numRunIsPrime(100)
console.log('numRunIsPrime(ตัวเลข) <= ใส่ตัวเลขเพื่อหาเลขเฉพาะที่หารแค่ 1 และตัวมันเองลงตัวเท่านั้น');
